<?php
namespace Mine;

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 常量与静态信息的解释         Link: http://www.hlzblog.top/
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/** 示例
 * echo \Mine\Consts::get(200); // 输出其中一个状态码解释
 * 这是用于方便对照查找
 */

class Consts
{
    // 统一返回格式配置
    private static $__conf = [
        /**
         * 业务逻辑错误码与对应描述信息配置
         */
        200                         => 'success',
        401                         => 'API调用速度太快，请稍候重试', // 达到接口限制调用次数
        403                         => '您没有相关访问权限', // 访问权限控制
        500                         => '服务器内部错误',

        /**
         * 通用参数
         */
        1000                        => '自定义临时报错',
        1001                        => '邮箱格式不正确',
        1002                        => '帐号格式要求为：英文字母开头的5~16位的英文和数字的组合',
        1003                        => '缺少必要参数',
        1004                        => '部分参数值不能为空',
        1005                        => '只允许 6~25位 长度的密码',
        1006                        => '您的昵称格式不正确',

        /**
         * 业务逻辑错误码与对应描述信息配置
         */
        2001                        => '帐号不存在',
        2002                        => '密码不正确',
        2003                        => '帐号已存在',

        //--------------------------------------------------------
        // 修改数据库中的 状态值时， 请使用当前配置的变量名来读取数据
        //--------------------------------------------------------

        /**
         * admin_account -> status : 帐号状态
         */
        "account_freeze"            => 0, // 冻结
        "account_as_usual"          => 1, // 正常

    ];

    /**
     * 获取自定义的状态码
     */
    public static function get($code)
    {
        return self::$__conf[$code];
    }
}
